cf/Catalogs/ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ВидыКонтактнойИнформации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъектаКонтактнойИнформации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактированиеВДиалоге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноРедактироватьТолькоВДиалоге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКартинки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/ВидыКонтактнойИнформации/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)

	Если ЭтоНовый() Тогда
		Порядок = 0;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидОбъектаКонтактнойИнформации) И Не Отказ И Порядок = 0 Тогда
		УстановитьПорядок();
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если (НЕ ОбменДанными.Загрузка) И (НЕ ЗначениеЗаполнено(ВидОбъектаКонтактнойИнформации) ИЛИ НЕ ЗначениеЗаполнено(Тип)) Тогда
		#Если Клиент Тогда
			Предупреждение("Укажите вид и тип объекта контактной информации.");
		#КонецЕсли
		
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьПорядок()

	ТЗ = "ВЫБРАТЬ
	|	МАКСИМУМ(ВидыКонтактнойИнформации.Порядок) КАК Порядок
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	ВидыКонтактнойИнформации.ВидОбъектаКонтактнойИнформации = &ВидОбъектаКонтактнойИнформации";
		
	Запрос = Новый Запрос;
	Запрос.Текст = ТЗ;
	Запрос.УстановитьПараметр("ВидОбъектаКонтактнойИнформации", ВидОбъектаКонтактнойИнформации);
	Выборка = Запрос.Выполнить().Выбрать();
		
	Порядок = ?(Выборка.Следующий() И Выборка.Порядок <> Null, Выборка.Порядок+1, 1);

КонецПроцедуры
